src/Catalogs/am_Автомобили/am_Автомобили.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>am_Автомобили</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>VIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецАвто</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГосударственныйРегистрационныйЗнак</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.am_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъёмДвигателя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоОРегистрацииТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДВС</name>
    <type>
      <types>CatalogRef.am_ТипДВС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКПП</name>
    <type>
      <types>CatalogRef.am_ТипКПП</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>EnumRef.am_ТипКузова</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>CatalogRef.am_Цвета</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/am_Автомобили/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ЗаполнитьНаименование()
	
	Если ЗначениеЗаполнено(Объект.Модель) Тогда
		Объект.Наименование = Объект.Модель.Владелец.Наименование + " " + Объект.Модель.Наименование + ", г/н " + Объект.ГосударственныйРегистрационныйЗнак;
	Иначе
		Объект.Наименование = "";
	КонецЕсли;
	
	ЭтаФорма.Заголовок = Объект.Наименование;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ГосударственныйРегистрационныйЗнакПриИзменении(Элемент)
	ЗаполнитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Записать();
    Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = Объект.Наименование;
	Если ЗначениеЗаполнено(Объект.Модель) Тогда
		АдресИзображения = ПолучитьНавигационнуюСсылку(Объект.Модель, "ОсновноеИзображение");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецАвтоПриИзменении(Элемент)
	Объект.Владелец = Объект.ВладелецАвто;
КонецПроцедуры
